nhattquangg2003-tech/STM32F103C8T6-BareMetal-Drivers/STM32F103C8T6 ARM Cortex M3/Drivers/Src/STM32F103C8T6_UART_driver.c
/*
 * STM32F103C8T6_UART_driver.c
 *
 *  Created on: Feb 25, 2026
 *      Author: Owner
 */
#include "STM32F103C8T6_UART_driver.h"
#include "STM32F103C8T6.h"
static uint32_t RCC_GetPCLK1Value(void);
static uint32_t RCC_GetPCLK2Value(void);
void USART_PeripheralControl(USART_RegDef_t *pUSARTx, uint8_t EnOrDi)
{
	if (EnOrDi == ENABLE)
	{
		pUSARTx->CR1 |= ( 1 << USART_CR1_UE );
	} else
	{
		pUSARTx->CR1 &= ~( 1 << USART_CR1_UE );
	}
}
//
//
//
void USART_PeriClockControl(USART_RegDef_t *pUSARTx, uint8_t EnorDi)
{
    if(EnorDi == ENABLE)
    {
        if(pUSARTx == USART1)
        {
            USART1_PCLK_EN();   // macro bật clock USART1 (APB2)
        }
        else if(pUSARTx == USART2)
        {
            USART2_PCLK_EN();   // macro bật clock USART2 (APB1)
        }
        else if(pUSARTx == USART3)
        {
            USART3_PCLK_EN();   // macro bật clock USART3 (APB1)
        }
        else if(pUSARTx == UART4)
        {
            UART4_PCLK_EN();    // macro bật clock UART4 (APB1)
        }
        else if(pUSARTx == UART5)
        {
            UART5_PCLK_EN();    // macro bật clock UART5 (APB1)
        }
    }
    else  // DISABLE
    {
        if(pUSARTx == USART1)
        {
            USART1_PCLK_DI();   // macro tắt clock USART1
        }
        else if(pUSARTx == USART2)
        {
            USART2_PCLK_DI();   // macro tắt clock USART2
        }
        else if(pUSARTx == USART3)
        {
            USART3_PCLK_DI();   // macro tắt clock USART3
        }
        else if(pUSARTx == UART4)
        {
            UART4_PCLK_DI();    // macro tắt clock UART4
        }
        else if(pUSARTx == UART5)
        {
            UART5_PCLK_DI();    // macro tắt clock UART5
        }
    }
}
//
//
//
/**
 ******************************************************************************
 * @fn      uint8_t USART_GetFlagStatus(USART_RegDef_t *pUSARTx , uint32_t FlagName)
 * @brief   Kiểm tra trạng thái của một cờ trong SR.
 *
 * @param   [in] pUSARTx   Địa chỉ cơ sở của USART/UART.
 * @param   [in] FlagName  Tên cờ (ví dụ USART_SR_RXNE, USART_SR_TXE).
 *
 * @return  FLAG_SET hoặc FLAG_RESET.
 ******************************************************************************
 */
uint8_t USART_GetFlagStatus(USART_RegDef_t *pUSARTx , uint32_t FlagName)
{
    if(pUSARTx->SR & FlagName)
    {
        return FLAG_SET;
    }
    return FLAG_RESET;
}

/**
 ******************************************************************************
 * @fn      void USART_ClearFlag(USART_RegDef_t *pUSARTx, uint16_t StatusFlagName)
 * @brief   Xóa một cờ trạng thái trong SR.
 *
 * @param   [in] pUSARTx          Địa chỉ cơ sở của USART/UART.
 * @param   [in] StatusFlagName   Tên cờ cần xóa (ví dụ USART_SR_TC, USART_SR_RXNE).
 *
 * @return  None
 *
 * @note    Một số cờ lỗi (ORE, NE, FE, PE) được xóa bằng cách đọc SR rồi đọc DR.
 *          Các cờ khác có thể xóa bằng cách ghi 0 vào bit tương ứng trong SR.
 ******************************************************************************
 */
void USART_ClearFlag(USART_RegDef_t *pUSARTx, uint16_t StatusFlagName)
{
    // Với STM32F1, hầu hết các cờ trong SR có thể xóa bằng cách ghi 0
    pUSARTx->SR &= ~(StatusFlagName);
}
/*********************************************************************
 * @fn      		  - USART_Init
 *
 * @brief             -
 *
 * @param[in]         -
 * @param[in]         -
 * @param[in]         -
 *
 * @return            -
 *
 * @Note              - Resolve all the TODOs

 */
void USART_Init(USART_Handle_t *pUSARTHandle)
{
    uint32_t tempreg = 0;

    /******************************** Configuration of CR1 ******************************************/

    // Enable the Clock for given USART peripheral
    USART_PeriClockControl(pUSARTHandle->pUSARTx, ENABLE);

    // Enable USART Tx and Rx engines according to the USART_Mode configuration item
    if (pUSARTHandle->USART_Config.USART_Mode == USART_MODE_ONLY_RX)
    {
        tempreg |= (1 << USART_CR1_RE);   // Receiver enable
    }
    else if (pUSARTHandle->USART_Config.USART_Mode == USART_MODE_ONLY_TX)
    {
        tempreg |= (1 << USART_CR1_TE);   // Transmitter enable
    }
    else if (pUSARTHandle->USART_Config.USART_Mode == USART_MODE_TXRX)
    {
        tempreg |= (1 << USART_CR1_RE);   // Receiver enable
        tempreg |= (1 << USART_CR1_TE);   // Transmitter enable
    }

    // Configure the Word length
    tempreg |= (pUSARTHandle->USART_Config.USART_WordLength << USART_CR1_M);

    // Configuration of parity control bit fields
    if (pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_EN_EVEN)
    {
        tempreg |= (1 << USART_CR1_PCE);  // Parity control enable
        // Even parity is default
    }
    else if (pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_EN_ODD)
    {
        tempreg |= (1 << USART_CR1_PCE);  // Parity control enable
        tempreg |= (1 << USART_CR1_PS);   // Odd parity
    }

    // Program the CR1 register
    pUSARTHandle->pUSARTx->CR1 = tempreg;

    /******************************** Configuration of CR2 ******************************************/

    tempreg = 0;

    // Configure the number of stop bits
    tempreg |= (pUSARTHandle->USART_Config.USART_NoOfStopBits << USART_CR2_STOP);

    // Program the CR2 register
    pUSARTHandle->pUSARTx->CR2 = tempreg;

    /******************************** Configuration of CR3 ******************************************/

    tempreg = 0;

    // Configuration of USART hardware flow control
    if (pUSARTHandle->USART_Config.USART_HWFlowControl == USART_HW_FLOW_CTRL_CTS)
    {
        tempreg |= (1 << USART_CR3_CTSE);   // CTS enable
    }
    else if (pUSARTHandle->USART_Config.USART_HWFlowControl == USART_HW_FLOW_CTRL_RTS)
    {
        tempreg |= (1 << USART_CR3_RTSE);   // RTS enable
    }
    else if (pUSARTHandle->USART_Config.USART_HWFlowControl == USART_HW_FLOW_CTRL_CTS_RTS)
    {
        tempreg |= (1 << USART_CR3_CTSE);   // CTS enable
        tempreg |= (1 << USART_CR3_RTSE);   // RTS enable
    }

