nhattquangg2003-tech/STM32F103C8T6-BareMetal-Drivers/STM32F103C8T6 ARM Cortex M3/Drivers/Src/STM32F103C8T6_UART_driver.c
    // Program the CR3 register
    pUSARTHandle->pUSARTx->CR3 = tempreg;

    /******************************** Configuration of BRR (Baudrate register) ******************************************/

    // Configure the baud rate
    USART_SetBaudRate(pUSARTHandle->pUSARTx, pUSARTHandle->USART_Config.USART_Baud);
}
/**
 ******************************************************************************
 * @fn      void USART_DeInit(USART_RegDef_t *pUSARTx)
 * @brief   Reset peripheral USART/UART về trạng thái mặc định.
 *
 * @param   [in] pUSARTx   Địa chỉ cơ sở của USART/UART (USART1, USART2, USART3, UART4, UART5).
 *
 * @return  None
 *
 * @note    Hàm này sẽ gọi macro reset tương ứng trong RCC.
 *          Sau khi reset, tất cả các thanh ghi cấu hình của USART/UART sẽ trở về giá trị mặc định.
 ******************************************************************************
 */
void USART_DeInit(USART_RegDef_t *pUSARTx)
{
    if(pUSARTx == USART1)
    {
        USART1_REG_RESET();
    }
    else if(pUSARTx == USART2)
    {
        USART2_REG_RESET();
    }
    else if(pUSARTx == USART3)
    {
        USART3_REG_RESET();
    }
    else if(pUSARTx == UART4)
    {
        UART4_REG_RESET();
    }
    else if(pUSARTx == UART5)
    {
        UART5_REG_RESET();
    }
}


/*********************************************************************
 * @fn                - USART_SendData
 *
 * @brief             -
 *
 * @param[in]         -
 * @param[in]         -
 * @param[in]         -
 *
 * @return            -
 *
 * @Note              - Resolve all the TODOs

 */
void USART_SendData(USART_Handle_t *pUSARTHandle, uint8_t *pTxBuffer, uint32_t Len)
{

    uint16_t *pdata;
   //Loop over until "Len" number of bytes are transferred
    for(uint32_t i = 0 ; i < Len; i++)
    {
        //Implement the code to wait until TXE flag is set in the SR
        while(! USART_GetFlagStatus(pUSARTHandle->pUSARTx, (1 << USART_SR_TXE)));

         //Check the USART_WordLength item for 9BIT or 8BIT in a frame
        if(pUSARTHandle->USART_Config.USART_WordLength == USART_WORDLEN_9BITS)
        {
            //if 9BIT, load the DR with 2bytes masking the bits other than first 9 bits
            pdata = (uint16_t*) pTxBuffer;
            pUSARTHandle->pUSARTx->DR = (*pdata & (uint16_t)0x01FF);

            //check for USART_ParityControl
            if(pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_DISABLE)
            {
                //No parity is used in this transfer. so, 9bits of user data will be sent
                //Implement the code to increment pTxBuffer twice
                pTxBuffer++;
                pTxBuffer++;
            }
            else
            {
                //Parity bit is used in this transfer . so , 8bits of user data will be sent
                //The 9th bit will be replaced by parity bit by the hardware
                pTxBuffer++;
            }
        }
        else
        {
            //This is 8bit data transfer
            pUSARTHandle->pUSARTx->DR = (*pTxBuffer  & (uint8_t)0xFF);

            //Implement the code to increment the buffer address
            pTxBuffer++;
        }
    }

    //Implement the code to wait till TC flag is set in the SR
    while( ! USART_GetFlagStatus(pUSARTHandle->pUSARTx, (1 << USART_SR_TC)));
}


/*********************************************************************
 * @fn                - USART_ReceiveData
 *
 * @brief             -
 *
 * @param[in]         -
 * @param[in]         -
 * @param[in]         -
 *
 * @return            -
 *
 * @Note              -

 */

void USART_ReceiveData(USART_Handle_t *pUSARTHandle, uint8_t *pRxBuffer, uint32_t Len)
{
   //Loop over until "Len" number of bytes are transferred
    for(uint32_t i = 0 ; i < Len; i++)
    {
        //Implement the code to wait until RXNE flag is set in the SR
        while(! USART_GetFlagStatus(pUSARTHandle->pUSARTx, (1 << USART_SR_RXNE)));

        //Check the USART_WordLength to decide whether we are going to receive 9bit of data in a frame or 8 bit
        if(pUSARTHandle->USART_Config.USART_WordLength == USART_WORDLEN_9BITS)
        {
            //We are going to receive 9bit data in a frame

            //check are we using USART_ParityControl control or not
            if(pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_DISABLE)
            {
                //No parity is used. so, all 9bits will be of user data

                //read only first 9 bits. so, mask the DR with 0x01FF
                *((uint16_t*) pRxBuffer) = (pUSARTHandle->pUSARTx->DR  & (uint16_t)0x01FF);

                //Now increment the pRxBuffer two times
                pRxBuffer++;
                pRxBuffer++;
            }
            else
            {
                //Parity is used, so, 8bits will be of user data and 1 bit is parity
                 *pRxBuffer = (pUSARTHandle->pUSARTx->DR  & (uint8_t)0xFF);

                 //Increment the pRxBuffer
                pRxBuffer++;
            }
        }
        else
        {
            //We are going to receive 8bit data in a frame

            //check are we using USART_ParityControl control or not
            if(pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_DISABLE)
            {
                //No parity is used , so all 8bits will be of user data

                //read 8 bits from DR
                 *pRxBuffer = (uint8_t)(pUSARTHandle->pUSARTx->DR & 0xFF);
            }

            else
            {
                //Parity is used, so , 7 bits will be of user data and 1 bit is parity

                //read only 7 bits , hence mask the DR with 0X7F
                 *pRxBuffer = (uint8_t)(pUSARTHandle->pUSARTx->DR & 0x7F);
            }

            //increment the pRxBuffer
            pRxBuffer++;
        }
    }

