nhattquangg2003-tech/STM32F103C8T6-BareMetal-Drivers/STM32F103C8T6 ARM Cortex M3/Drivers/Src/STM32F103C8T6_UART_driver.c
}

/*********************************************************************
 * @fn                - USART_SendDataWithIT
 *
 * @brief             -
 *
 * @param[in]         -
 * @param[in]         -
 * @param[in]         -
 *
 * @return            -
 *
 * @Note              - Resolve all the TODOs

 */
uint8_t USART_SendDataIT(USART_Handle_t *pUSARTHandle,uint8_t *pTxBuffer, uint32_t Len)
{
    uint8_t txstate = pUSARTHandle->TxBusyState;

    if(txstate != USART_BUSY_IN_TX)
    {
        pUSARTHandle->TxLen = Len;
        pUSARTHandle->pTxBuffer = pTxBuffer;
        pUSARTHandle->TxBusyState = USART_BUSY_IN_TX;

        //Implement the code to enable interrupt for TXE
        pUSARTHandle->pUSARTx->CR1 |= (1 << USART_CR1_TXEIE);


        //Implement the code to enable interrupt for TC
        pUSARTHandle->pUSARTx->CR1 |= (1 << USART_CR1_TCIE);


    }

    return txstate;

}

/*********************************************************************
 * @fn                - USART_ReceiveDataIT
 *
 * @brief             -
 *
 * @param[in]         -
 * @param[in]         -
 * @param[in]         -
 *
 * @return            -
 *
 *********************************************************************/
uint8_t USART_ReceiveDataIT(USART_Handle_t *pUSARTHandle,uint8_t *pRxBuffer, uint32_t Len)
{
    uint8_t rxstate = pUSARTHandle->RxBusyState;

    if(rxstate != USART_BUSY_IN_RX)
    {
        pUSARTHandle->RxLen = Len;
        pUSARTHandle->pRxBuffer = pRxBuffer;
        pUSARTHandle->RxBusyState = USART_BUSY_IN_RX;

        //Implement the code to enable interrupt for RXNE
        pUSARTHandle->pUSARTx->CR1 |= (1 << USART_CR1_RXNEIE);
    }

    return rxstate;
}
/*********************************************************************
 * @fn                - USART_SetBaudRate
 *
 * @brief             Cấu hình baud rate cho USART
 *
 * @param[in]         pUSARTx   : Peripheral USART cần cấu hình
 * @param[in]         BaudRate  : Giá trị baud rate mong muốn
 *
 * @return            None
 *
 * @Note              - Resolve all the TODOs
 *********************************************************************/
void USART_SetBaudRate(USART_RegDef_t *pUSARTx, uint32_t BaudRate)
{
    //Variable to hold the APB clock
    uint32_t PCLKx;

    uint32_t usartdiv;

    //variables to hold Mantissa and Fraction values
    uint32_t M_part,F_part;

    uint32_t tempreg=0;

    //Get the value of APB bus clock in to the variable PCLKx
    if(pUSARTx == USART1)
    {
       //USART1 is hanging on APB2 bus
       PCLKx = RCC_GetPCLK2Value();
    }
    else
    {
       //USART2,3,4,5 are on APB1 bus
       PCLKx = RCC_GetPCLK1Value();
    }

    //Check for OVER8 configuration bit
    if(pUSARTx->CR1 & (1 << USART_CR1_OVER8))
    {
       //OVER8 = 1 , oversampling by 8
       usartdiv = ((25 * PCLKx) / (2 * BaudRate));
    }
    else
    {
       //OVER8 = 0 , oversampling by 16
       usartdiv = ((25 * PCLKx) / (4 * BaudRate));
    }

    //Calculate the Mantissa part
    M_part = usartdiv / 100;

    //Place the Mantissa part in appropriate bit position . refer USART_BRR
    tempreg |= (M_part << 4);

    //Extract the fraction part
    F_part = (usartdiv - (M_part * 100));

    //Calculate the final fractional
    if(pUSARTx->CR1 & (1 << USART_CR1_OVER8))
    {
      //OVER8 = 1 , oversampling by 8
      F_part = (((F_part * 8) + 50) / 100) & ((uint8_t)0x07);
    }
    else
    {
      //OVER8 = 0 , oversampling by 16
      F_part = (((F_part * 16) + 50) / 100) & ((uint8_t)0x0F);
    }

    //Place the fractional part in appropriate bit position . refer USART_BRR
    tempreg |= F_part;

    //copy the value of tempreg in to BRR register
    pUSARTx->BRR = tempreg;
}
//
//
//
static uint32_t RCC_GetPCLK1Value(void)
{
    uint32_t SystemClk = 0, pclk1;
    uint32_t clksrc, temp, ahbp, apb1p;

    clksrc = ((RCC->CFGR >> 2) & 0x3);

    if(clksrc == 0)
    {
        SystemClk = 16000000; // HSI = 16 MHz
    }
    else if(clksrc == 1)
    {
        SystemClk = 8000000;  // HSE = 8 MHz (thường dùng trên STM32F103C8T6)
    }
    else if(clksrc == 2)
    {
        // PLL selected
        uint32_t pll_src, pll_mul;
        pll_src = (RCC->CFGR >> 16) & 0x1;   // PLL source
        pll_mul = ((RCC->CFGR >> 18) & 0xF) + 2; // PLL multiplier (x2..x16)

        if(pll_src == 0)
        {
            // HSI/2 as PLL input
            SystemClk = (16000000 / 2) * pll_mul;
        }
        else
        {
            // HSE as PLL input
            SystemClk = 8000000 * pll_mul;
        }
    }

    // AHB prescaler
    temp = (RCC->CFGR >> 4) & 0xF;
    if(temp < 8)
    {
        ahbp = 1;
    }
    else
    {
        static const uint16_t AHB_PreScaler[8] = {2,4,8,16,64,128,256,512};
        ahbp = AHB_PreScaler[temp - 8];
    }
    uint32_t Hclk = SystemClk / ahbp;

    // APB1 prescaler
    temp = (RCC->CFGR >> 8) & 0x7;
    if(temp < 4)
    {
        apb1p = 1;
    }
    else
    {
        static const uint8_t APB1_PreScaler[4] = {2,4,8,16};
        apb1p = APB1_PreScaler[temp - 4];
    }

    pclk1 = Hclk / apb1p;

    return pclk1;
}
//
//
//
static uint32_t RCC_GetPCLK2Value(void)
{
    uint32_t SystemClk = 0, pclk2;
    uint32_t clksrc, temp, ahbp, apb2p;

    // Lấy nguồn clock hệ thống
    clksrc = ((RCC->CFGR >> 2) & 0x3);

    if(clksrc == 0)
    {
        SystemClk = 16000000; // HSI = 16 MHz
    }
    else if(clksrc == 1)
    {
        SystemClk = 8000000;  // HSE = 8 MHz
    }
    else if(clksrc == 2)
    {
        // PLL selected
        uint32_t pll_src, pll_mul;
        pll_src = (RCC->CFGR >> 16) & 0x1;   // PLL source
        pll_mul = ((RCC->CFGR >> 18) & 0xF) + 2; // PLL multiplier (x2..x16)

        if(pll_src == 0)
        {
            // HSI/2 as PLL input
            SystemClk = (16000000 / 2) * pll_mul;
        }
        else
        {
            // HSE as PLL input
            SystemClk = 8000000 * pll_mul;
        }
    }

    // AHB prescaler
    temp = (RCC->CFGR >> 4) & 0xF;
    if(temp < 8)
    {
        ahbp = 1;
    }
    else
    {
        static const uint16_t AHB_PreScaler[8] = {2,4,8,16,64,128,256,512};
        ahbp = AHB_PreScaler[temp - 8];
    }
    uint32_t Hclk = SystemClk / ahbp;

    // APB2 prescaler
    temp = (RCC->CFGR >> 11) & 0x7;
    if(temp < 4)
    {
        apb2p = 1;
    }
    else
    {
        static const uint8_t APB2_PreScaler[4] = {2,4,8,16};
        apb2p = APB2_PreScaler[temp - 4];
    }

    pclk2 = Hclk / apb2p;

    return pclk2;
}
//
//
//
void USART_IRQInterruptConfig(uint8_t IRQNumber, uint8_t EnorDi)
{
	if(EnorDi == ENABLE)
			    {
			        if(IRQNumber <= 31)
			        {
			            // program ISER0 register
			        	*NVIC_ISER0 |= (1 << IRQNumber);

