nhattquangg2003-tech/STM32F103C8T6-BareMetal-Drivers/STM32F103C8T6 ARM Cortex M3/Drivers/Src/STM32F103C8T6_UART_driver.c
			        }
			        else if( IRQNumber > 31 && IRQNumber < 64 ) // 32 to 63
			        {
			        	// program ISER1 register
			        	*NVIC_ISER1 |= (1 << IRQNumber % 32);
			        }
			        else if(IRQNumber >= 64 && IRQNumber < 96 ) // 64 to 95
			        {
			        	// program ISER2 register
			        	*NVIC_ISER2 |= (1 << IRQNumber % 64);
			        }
			    }
			    else  // DISABLE
			    {
			        if(IRQNumber <= 31)
			    	        {
			    	            // program ISER0 register
			        	      *NVIC_ICER0  |= (1 << IRQNumber);

			    	        }
			    	        else if( IRQNumber > 31 && IRQNumber < 64 ) // 32 to 63
			    	        {
			    	        	// program ISER1 register
			    	        	*NVIC_ICER1 |= (1 << IRQNumber % 32);
			    	        }
			    	        else if(IRQNumber >= 64 && IRQNumber < 96 )
			    	        {
			    	        	// program ISER2 register
			    	        	*NVIC_ICER2 |= (1 << IRQNumber % 64);
			    	        }

			    }
}
//
///
//
void USART_IRQPriorityConfig(uint8_t IRQNumber, uint32_t IRQPriority)
{
	// 1. first lets find out the ipr register
				uint8_t iprx = IRQNumber / 4;
				uint8_t iprx_section = IRQNumber % 4 ;
				uint8_t shift_amount = ( iprx_section*8 ) - ( 8- NO_PR_BITS_IMPLEMENT );
				*(NVIC_PR_BASE_ADDR + (iprx * 4)) |= (IRQPriority << shift_amount );
}
//
//
//
/*********************************************************************
 * @fn                - USART_IRQHandler
 *
 * @brief             -
 *
 * @param[in]         -
 * @param[in]         -
 * @param[in]         -
 *
 * @return            -
 *
 * @Note              - Resolve all the TODOs

 */
void USART_IRQHandling(USART_Handle_t *pUSARTHandle)
{

    uint32_t temp1 , temp2, temp3;
    uint16_t *pdata;
    // Lấy buffer từ handle
    uint8_t *pTxBuffer = pUSARTHandle->pTxBuffer;
    uint8_t *pRxBuffer = pUSARTHandle->pRxBuffer;
/*************************Check for TC flag ********************************************/

    //Implement the code to check the state of TC bit in the SR
    temp1 = pUSARTHandle->pUSARTx->SR & ( 1 << USART_SR_TC);

     //Implement the code to check the state of TCEIE bit
    temp2 = pUSARTHandle->pUSARTx->CR1 & ( 1 << USART_CR1_TCIE);

    if(temp1 && temp2 )
    {
        //this interrupt is because of TC

        //close transmission and call application callback if TxLen is zero
        if ( pUSARTHandle->TxBusyState == USART_BUSY_IN_TX)
        {
            //Check the TxLen . If it is zero then close the data transmission
            if(! pUSARTHandle->TxLen )
            {
                //Implement the code to clear the TC flag
                pUSARTHandle->pUSARTx->SR &= ~( 1 << USART_SR_TC);

                //Implement the code to clear the TCIE control bit
                pUSARTHandle->pUSARTx->CR1 &= ~( 1 << USART_CR1_TCIE);

                //Reset the application state
                pUSARTHandle->TxBusyState = USART_READY;

                //Reset Buffer address to NULL
                pUSARTHandle->pTxBuffer = NULL;

                //Reset the length to zero
                pUSARTHandle->TxLen = 0;

                //Call the applicaton call back with event USART_EVENT_TX_CMPLT
                USART_ApplicationEventCallback(pUSARTHandle,USART_EVENT_TX_CMPLT);
            }
        }
    }

/*************************Check for TXE flag ********************************************/

    //Implement the code to check the state of TXE bit in the SR
    temp1 = pUSARTHandle->pUSARTx->SR & ( 1 << USART_SR_TXE);

    //Implement the code to check the state of TXEIE bit in CR1
    temp2 = pUSARTHandle->pUSARTx->CR1 & ( 1 << USART_CR1_TXEIE);


    if(temp1 && temp2 )
    {
        //this interrupt is because of TXE

        if(pUSARTHandle->TxBusyState == USART_BUSY_IN_TX)
        {
            //Keep sending data until Txlen reaches to zero
            if(pUSARTHandle->TxLen > 0)
            {
                //Check the USART_WordLength item for 9BIT or 8BIT in a frame
                if(pUSARTHandle->USART_Config.USART_WordLength == USART_WORDLEN_9BITS)
                {
                    //if 9BIT , load the DR with 2bytes masking the bits other than first 9 bits
                	pdata = (uint16_t*) pTxBuffer;

                    //loading only first 9 bits , so we have to mask with the value 0x01FF
                    pUSARTHandle->pUSARTx->DR = (*pdata & (uint16_t)0x01FF);

                    //check for USART_ParityControl
                    if(pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_DISABLE)
                    {
                        //No parity is used in this transfer , so, 9bits of user data will be sent
                        //Implement the code to increment pTxBuffer twice
                        pTxBuffer++;
                        pTxBuffer++;

                        //Implement the code to decrement the length
                        pUSARTHandle->TxLen -= 2;
                    }
                    else
                    {
                        //Parity bit is used in this transfer . so , 8bits of user data will be sent
                        //The 9th bit will be replaced by parity bit by the hardware
                        pTxBuffer++;

                        //Implement the code to decrement the length
                        pUSARTHandle->TxLen -= 1;
                    }
                }
                else
                {
                    //This is 8bit data transfer
                    pUSARTHandle->pUSARTx->DR = (*pTxBuffer  & (uint8_t)0xFF);

                    //Implement the code to increment the buffer address
                    pTxBuffer++;

                    //Implement the code to decrement the length
                    pUSARTHandle->TxLen -= 1;
                }

            }
            if (pUSARTHandle->TxLen == 0 )
            {
                //TxLen is zero
                //Implement the code to clear the TXEIE bit (disable interrupt for TXE flag )
                pUSARTHandle->pUSARTx->CR1 &= ~( 1 << USART_CR1_TXEIE );
            }
        }
    }

/*************************Check for RXNE flag ********************************************/

