nhattquangg2003-tech/STM32F103C8T6-BareMetal-Drivers/STM32F103C8T6 ARM Cortex M3/Drivers/Src/STM32F103C8T6_UART_driver.c
    temp1 = pUSARTHandle->pUSARTx->SR & ( 1 << USART_SR_RXNE);
    temp2 = pUSARTHandle->pUSARTx->CR1 & ( 1 << USART_CR1_RXNEIE);


    if(temp1 && temp2 )
    {
        //this interrupt is because of rxne
        //this interrupt is because of txe
        if(pUSARTHandle->RxBusyState == USART_BUSY_IN_RX)
        {
            //TXE is set so send data
            if(pUSARTHandle->RxLen > 0)
            {
                //Check the USART_WordLength to decide whether we are going to receive 9bit of data in a frame or 8 bit
                if(pUSARTHandle->USART_Config.USART_WordLength == USART_WORDLEN_9BITS)
                {
                    //We are going to receive 9bit data in a frame

                    //Now, check are we using USART_ParityControl control or not
                    if(pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_DISABLE)
                    {
                        //No parity is used. so, all 9bits will be of user data

                        //read only first 9 bits so mask the DR with 0x01FF
                        *((uint16_t*) pRxBuffer) = (pUSARTHandle->pUSARTx->DR  & (uint16_t)0x01FF);

                        //Now increment the pRxBuffer two times
                        pRxBuffer++;
                        pRxBuffer++;

                        //Implement the code to decrement the length
                        pUSARTHandle->RxLen -= 2;
                    }
                    else
                    {
                        //Parity is used. so, 8bits will be of user data and 1 bit is parity
                         *pRxBuffer = (pUSARTHandle->pUSARTx->DR  & (uint8_t)0xFF);

                         //Now increment the pRxBuffer
                         pRxBuffer++;

                         //Implement the code to decrement the length
                         pUSARTHandle->RxLen -= 1;
                    }
                }
                else
                {
                    //We are going to receive 8bit data in a frame

                    //Now, check are we using USART_ParityControl control or not
                    if(pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_DISABLE)
                    {
                        //No parity is used , so all 8bits will be of user data

                        //read 8 bits from DR
                         *pRxBuffer = (uint8_t) (pUSARTHandle->pUSARTx->DR  & (uint8_t)0xFF);
                    }

                    else
                    {
                        //Parity is used, so , 7 bits will be of user data and 1 bit is parity

                        //read only 7 bits , hence mask the DR with 0X7F
                         *pRxBuffer = (uint8_t) (pUSARTHandle->pUSARTx->DR  & (uint8_t)0x7F);

                    }

                    //Now , increment the pRxBuffer
                    pRxBuffer++;

                    //Implement the code to decrement the length
                    pUSARTHandle->RxLen -= 1;
                }


            }//if of >0

            if(! pUSARTHandle->RxLen)
            {
                //disable the rxne
                pUSARTHandle->pUSARTx->CR1 &= ~( 1 << USART_CR1_RXNEIE );
                pUSARTHandle->RxBusyState = USART_READY;
                USART_ApplicationEventCallback(pUSARTHandle,USART_EVENT_RX_CMPLT);
            }
        }
    }


    /*************************Check for CTS flag ********************************************/
    //Note : CTS feature is not applicable for UART4 and UART5

        //Implement the code to check the status of CTS bit in the SR
        temp1 = pUSARTHandle->pUSARTx->SR & ( 1 << USART_SR_CTS);

        //Implement the code to check the state of CTSE bit in CR1
        temp2 = pUSARTHandle->pUSARTx->CR3 & ( 1 << USART_CR3_CTSE);

        //Implement the code to check the state of CTSIE bit in CR3 (This bit is not available for UART4 & UART5.)
        temp3 = pUSARTHandle->pUSARTx->CR3 & ( 1 << USART_CR3_CTSIE);

        if(temp1  && temp2 && temp3 )
        {
            //Implement the code to clear the CTS flag in SR
            pUSARTHandle->pUSARTx->SR &= ~( 1 << USART_SR_CTS);

            //this interrupt is because of cts
            USART_ApplicationEventCallback(pUSARTHandle,USART_EVENT_CTS);
        }

    /*************************Check for IDLE detection flag ********************************************/

        //Implement the code to check the status of IDLE flag bit in the SR
        temp1 = pUSARTHandle->pUSARTx->SR & ( 1 << USART_SR_IDLE);

        //Implement the code to check the state of IDLEIE bit in CR1
        temp2 = pUSARTHandle->pUSARTx->CR1 & ( 1 << USART_CR1_IDLEIE);

        if(temp1 && temp2)
        {
            //Implement the code to clear the IDLE flag. Refer to the RM to understand the clear sequence
            volatile uint32_t dummy = pUSARTHandle->pUSARTx->SR;
            dummy = pUSARTHandle->pUSARTx->DR;
            (void)dummy;

            //this interrupt is because of idle
            USART_ApplicationEventCallback(pUSARTHandle,USART_EVENT_IDLE);
        }

    /*************************Check for Overrun detection flag ********************************************/

        //Implement the code to check the status of ORE flag  in the SR
        temp1 = pUSARTHandle->pUSARTx->SR & ( 1 << USART_SR_ORE);

        //Implement the code to check the status of RXNEIE  bit in the CR1
        temp2 = pUSARTHandle->pUSARTx->CR1 & ( 1 << USART_CR1_RXNEIE);

        if(temp1  && temp2 )
        {
            //Need not to clear the ORE flag here, instead give an api for the application to clear the ORE flag .

            //this interrupt is because of Overrun error
            USART_ApplicationEventCallback(pUSARTHandle,USART_EVENT_ORE);
        }

    /*************************Check for Error Flag ********************************************/

    //Noise Flag, Overrun error and Framing Error in multibuffer communication
    //We dont discuss multibuffer communication in this course. please refer to the RM
    //The blow code will get executed in only if multibuffer mode is used.

        temp2 =  pUSARTHandle->pUSARTx->CR3 & ( 1 << USART_CR3_EIE) ;

        if(temp2 )
        {
            temp1 = pUSARTHandle->pUSARTx->SR;
            if(temp1 & ( 1 << USART_SR_FE))
            {
                /*
                    This bit is set by hardware when a de-synchronization, excessive noise or a break character
                    is detected. It is cleared by a software sequence (an read to the USART_SR register
                    followed by a read to the USART_DR register).
                */
                USART_ApplicationEventCallback(pUSARTHandle,USART_ERREVENT_FE);
            }

            if(temp1 & ( 1 << USART_SR_NE) )
            {
                /*
                    This bit is set by hardware when noise is detected on a received frame. It is cleared by a
                    software sequence (an read to the USART_SR register followed by a read to the
                    USART_DR register).
                */
                USART_ApplicationEventCallback(pUSARTHandle,USART_ERREVENT_NE);
            }

            if(temp1 & ( 1 << USART_SR_ORE) )
            {
                USART_ApplicationEventCallback(pUSARTHandle,USART_ERREVENT_ORE);
            }
        }
}





